MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2025DAS176/mcu.h
extern volatile __C2CFGbits_t C2CFGbits __asm__ ("C2CFG") __attribute__((section("sfrs"), address(0xBF881010)));
extern volatile uint32_t        C2CFGCLR __attribute__((section("sfrs"),address(0xBF881014)));
extern volatile uint32_t        C2CFGSET __attribute__((section("sfrs"),address(0xBF881018)));
extern volatile uint32_t        C2CFGINV __attribute__((section("sfrs"),address(0xBF88101C)));
#define C2INT C2INT
extern volatile uint32_t   C2INT __attribute__((section("sfrs"), address(0xBF881020)));
typedef union {
  struct {
    uint32_t TBIF:1;
    uint32_t RBIF:1;
    uint32_t CTMRIF:1;
    uint32_t MODIF:1;
    uint32_t :7;
    uint32_t RBOVIF:1;
    uint32_t SERRIF:1;
    uint32_t CERRIF:1;
    uint32_t WAKIF:1;
    uint32_t IVRIF:1;
    uint32_t TBIE:1;
    uint32_t RBIE:1;
    uint32_t CTMRIE:1;
    uint32_t MODIE:1;
    uint32_t :7;
    uint32_t RBOVIE:1;
    uint32_t SERRIE:1;
    uint32_t CERRIE:1;
    uint32_t WAKIE:1;
    uint32_t IVRIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2INTbits_t;
extern volatile __C2INTbits_t C2INTbits __asm__ ("C2INT") __attribute__((section("sfrs"), address(0xBF881020)));
extern volatile uint32_t        C2INTCLR __attribute__((section("sfrs"),address(0xBF881024)));
extern volatile uint32_t        C2INTSET __attribute__((section("sfrs"),address(0xBF881028)));
extern volatile uint32_t        C2INTINV __attribute__((section("sfrs"),address(0xBF88102C)));
#define C2VEC C2VEC
extern volatile uint32_t   C2VEC __attribute__((section("sfrs"), address(0xBF881030)));
typedef union {
  struct {
    uint32_t ICODE:7;
    uint32_t :1;
    uint32_t FILHIT:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2VECbits_t;
extern volatile __C2VECbits_t C2VECbits __asm__ ("C2VEC") __attribute__((section("sfrs"), address(0xBF881030)));
extern volatile uint32_t        C2VECCLR __attribute__((section("sfrs"),address(0xBF881034)));
extern volatile uint32_t        C2VECSET __attribute__((section("sfrs"),address(0xBF881038)));
extern volatile uint32_t        C2VECINV __attribute__((section("sfrs"),address(0xBF88103C)));
#define C2TREC C2TREC
extern volatile uint32_t   C2TREC __attribute__((section("sfrs"), address(0xBF881040)));
typedef union {
  struct {
    uint32_t RERRCNT:8;
    uint32_t TERRCNT:8;
    uint32_t EWARN:1;
    uint32_t RXWARN:1;
    uint32_t TXWARN:1;
    uint32_t RXBP:1;
    uint32_t TXBP:1;
    uint32_t TXBO:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2TRECbits_t;
extern volatile __C2TRECbits_t C2TRECbits __asm__ ("C2TREC") __attribute__((section("sfrs"), address(0xBF881040)));
extern volatile uint32_t        C2TRECCLR __attribute__((section("sfrs"),address(0xBF881044)));
extern volatile uint32_t        C2TRECSET __attribute__((section("sfrs"),address(0xBF881048)));
extern volatile uint32_t        C2TRECINV __attribute__((section("sfrs"),address(0xBF88104C)));
#define C2FSTAT C2FSTAT
extern volatile uint32_t   C2FSTAT __attribute__((section("sfrs"), address(0xBF881050)));
typedef union {
  struct {
    uint32_t FIFOIP:32;
  };
  struct {
    uint32_t FIFOIP0:1;
    uint32_t FIFOIP1:1;
    uint32_t FIFOIP2:1;
    uint32_t FIFOIP3:1;
    uint32_t FIFOIP4:1;
    uint32_t FIFOIP5:1;
    uint32_t FIFOIP6:1;
    uint32_t FIFOIP7:1;
    uint32_t FIFOIP8:1;
    uint32_t FIFOIP9:1;
    uint32_t FIFOIP10:1;
    uint32_t FIFOIP11:1;
    uint32_t FIFOIP12:1;
    uint32_t FIFOIP13:1;
    uint32_t FIFOIP14:1;
    uint32_t FIFOIP15:1;
    uint32_t FIFOIP16:1;
    uint32_t FIFOIP17:1;
    uint32_t FIFOIP18:1;
    uint32_t FIFOIP19:1;
    uint32_t FIFOIP20:1;
    uint32_t FIFOIP21:1;
    uint32_t FIFOIP22:1;
    uint32_t FIFOIP23:1;
    uint32_t FIFOIP24:1;
    uint32_t FIFOIP25:1;
    uint32_t FIFOIP26:1;
    uint32_t FIFOIP27:1;
    uint32_t FIFOIP28:1;
    uint32_t FIFOIP29:1;
    uint32_t FIFOIP30:1;
    uint32_t FIFOIP31:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FSTATbits_t;
extern volatile __C2FSTATbits_t C2FSTATbits __asm__ ("C2FSTAT") __attribute__((section("sfrs"), address(0xBF881050)));
extern volatile uint32_t        C2FSTATCLR __attribute__((section("sfrs"),address(0xBF881054)));
extern volatile uint32_t        C2FSTATSET __attribute__((section("sfrs"),address(0xBF881058)));
extern volatile uint32_t        C2FSTATINV __attribute__((section("sfrs"),address(0xBF88105C)));
#define C2RXOVF C2RXOVF
extern volatile uint32_t   C2RXOVF __attribute__((section("sfrs"), address(0xBF881060)));
typedef union {
  struct {
    uint32_t RXOVF:32;
  };
  struct {
    uint32_t RXOVF0:1;
    uint32_t RXOVF1:1;
    uint32_t RXOVF2:1;
    uint32_t RXOVF3:1;
    uint32_t RXOVF4:1;
    uint32_t RXOVF5:1;
    uint32_t RXOVF6:1;
    uint32_t RXOVF7:1;
    uint32_t RXOVF8:1;
    uint32_t RXOVF9:1;
    uint32_t RXOVF10:1;
    uint32_t RXOVF11:1;
    uint32_t RXOVF12:1;
    uint32_t RXOVF13:1;
    uint32_t RXOVF14:1;
    uint32_t RXOVF15:1;
    uint32_t RXOVF16:1;
    uint32_t RXOVF17:1;
    uint32_t RXOVF18:1;
    uint32_t RXOVF19:1;
    uint32_t RXOVF20:1;
    uint32_t RXOVF21:1;
    uint32_t RXOVF22:1;
    uint32_t RXOVF23:1;
    uint32_t RXOVF24:1;
    uint32_t RXOVF25:1;
    uint32_t RXOVF26:1;
    uint32_t RXOVF27:1;
    uint32_t RXOVF28:1;
    uint32_t RXOVF29:1;
    uint32_t RXOVF30:1;
    uint32_t RXOVF31:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXOVFbits_t;
extern volatile __C2RXOVFbits_t C2RXOVFbits __asm__ ("C2RXOVF") __attribute__((section("sfrs"), address(0xBF881060)));
extern volatile uint32_t        C2RXOVFCLR __attribute__((section("sfrs"),address(0xBF881064)));
extern volatile uint32_t        C2RXOVFSET __attribute__((section("sfrs"),address(0xBF881068)));
extern volatile uint32_t        C2RXOVFINV __attribute__((section("sfrs"),address(0xBF88106C)));
#define C2TMR C2TMR
extern volatile uint32_t   C2TMR __attribute__((section("sfrs"), address(0xBF881070)));
typedef union {
  struct {
    uint32_t CANTSPRE:16;
    uint32_t CANTS:16;
  };
  struct {
    uint32_t w:32;
  };
} __C2TMRbits_t;
extern volatile __C2TMRbits_t C2TMRbits __asm__ ("C2TMR") __attribute__((section("sfrs"), address(0xBF881070)));
extern volatile uint32_t        C2TMRCLR __attribute__((section("sfrs"),address(0xBF881074)));
extern volatile uint32_t        C2TMRSET __attribute__((section("sfrs"),address(0xBF881078)));
extern volatile uint32_t        C2TMRINV __attribute__((section("sfrs"),address(0xBF88107C)));
#define C2RXM0 C2RXM0
extern volatile uint32_t   C2RXM0 __attribute__((section("sfrs"), address(0xBF881080)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t MIDE:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXM0bits_t;
extern volatile __C2RXM0bits_t C2RXM0bits __asm__ ("C2RXM0") __attribute__((section("sfrs"), address(0xBF881080)));
extern volatile uint32_t        C2RXM0CLR __attribute__((section("sfrs"),address(0xBF881084)));
extern volatile uint32_t        C2RXM0SET __attribute__((section("sfrs"),address(0xBF881088)));
extern volatile uint32_t        C2RXM0INV __attribute__((section("sfrs"),address(0xBF88108C)));
#define C2RXM1 C2RXM1
extern volatile uint32_t   C2RXM1 __attribute__((section("sfrs"), address(0xBF881090)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t MIDE:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXM1bits_t;
extern volatile __C2RXM1bits_t C2RXM1bits __asm__ ("C2RXM1") __attribute__((section("sfrs"), address(0xBF881090)));
extern volatile uint32_t        C2RXM1CLR __attribute__((section("sfrs"),address(0xBF881094)));
extern volatile uint32_t        C2RXM1SET __attribute__((section("sfrs"),address(0xBF881098)));
extern volatile uint32_t        C2RXM1INV __attribute__((section("sfrs"),address(0xBF88109C)));
#define C2RXM2 C2RXM2
extern volatile uint32_t   C2RXM2 __attribute__((section("sfrs"), address(0xBF8810A0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t MIDE:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXM2bits_t;
extern volatile __C2RXM2bits_t C2RXM2bits __asm__ ("C2RXM2") __attribute__((section("sfrs"), address(0xBF8810A0)));
extern volatile uint32_t        C2RXM2CLR __attribute__((section("sfrs"),address(0xBF8810A4)));
extern volatile uint32_t        C2RXM2SET __attribute__((section("sfrs"),address(0xBF8810A8)));
extern volatile uint32_t        C2RXM2INV __attribute__((section("sfrs"),address(0xBF8810AC)));
#define C2RXM3 C2RXM3
extern volatile uint32_t   C2RXM3 __attribute__((section("sfrs"), address(0xBF8810B0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t MIDE:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXM3bits_t;
extern volatile __C2RXM3bits_t C2RXM3bits __asm__ ("C2RXM3") __attribute__((section("sfrs"), address(0xBF8810B0)));
extern volatile uint32_t        C2RXM3CLR __attribute__((section("sfrs"),address(0xBF8810B4)));
extern volatile uint32_t        C2RXM3SET __attribute__((section("sfrs"),address(0xBF8810B8)));
extern volatile uint32_t        C2RXM3INV __attribute__((section("sfrs"),address(0xBF8810BC)));
#define C2FLTCON0 C2FLTCON0
extern volatile uint32_t   C2FLTCON0 __attribute__((section("sfrs"), address(0xBF8810C0)));
typedef union {
  struct {
    uint32_t FSEL0:5;
    uint32_t MSEL0:2;
    uint32_t FLTEN0:1;
    uint32_t FSEL1:5;
    uint32_t MSEL1:2;
    uint32_t FLTEN1:1;
    uint32_t FSEL2:5;
    uint32_t MSEL2:2;
    uint32_t FLTEN2:1;
    uint32_t FSEL3:5;
    uint32_t MSEL3:2;
    uint32_t FLTEN3:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FLTCON0bits_t;
extern volatile __C2FLTCON0bits_t C2FLTCON0bits __asm__ ("C2FLTCON0") __attribute__((section("sfrs"), address(0xBF8810C0)));
extern volatile uint32_t        C2FLTCON0CLR __attribute__((section("sfrs"),address(0xBF8810C4)));
extern volatile uint32_t        C2FLTCON0SET __attribute__((section("sfrs"),address(0xBF8810C8)));
extern volatile uint32_t        C2FLTCON0INV __attribute__((section("sfrs"),address(0xBF8810CC)));
#define C2FLTCON1 C2FLTCON1
extern volatile uint32_t   C2FLTCON1 __attribute__((section("sfrs"), address(0xBF8810D0)));
typedef union {
  struct {
    uint32_t FSEL4:5;
    uint32_t MSEL4:2;
    uint32_t FLTEN4:1;
    uint32_t FSEL5:5;
    uint32_t MSEL5:2;
    uint32_t FLTEN5:1;
    uint32_t FSEL6:5;
    uint32_t MSEL6:2;
    uint32_t FLTEN6:1;
    uint32_t FSEL7:5;
    uint32_t MSEL7:2;
    uint32_t FLTEN7:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FLTCON1bits_t;
extern volatile __C2FLTCON1bits_t C2FLTCON1bits __asm__ ("C2FLTCON1") __attribute__((section("sfrs"), address(0xBF8810D0)));
extern volatile uint32_t        C2FLTCON1CLR __attribute__((section("sfrs"),address(0xBF8810D4)));
extern volatile uint32_t        C2FLTCON1SET __attribute__((section("sfrs"),address(0xBF8810D8)));
extern volatile uint32_t        C2FLTCON1INV __attribute__((section("sfrs"),address(0xBF8810DC)));
#define C2FLTCON2 C2FLTCON2
extern volatile uint32_t   C2FLTCON2 __attribute__((section("sfrs"), address(0xBF8810E0)));
typedef union {
  struct {
    uint32_t FSEL8:5;
    uint32_t MSEL8:2;
    uint32_t FLTEN8:1;
    uint32_t FSEL9:5;
    uint32_t MSEL9:2;
    uint32_t FLTEN9:1;
    uint32_t FSEL10:5;
    uint32_t MSEL10:2;
    uint32_t FLTEN10:1;
    uint32_t FSEL11:5;
    uint32_t MSEL11:2;
    uint32_t FLTEN11:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FLTCON2bits_t;
extern volatile __C2FLTCON2bits_t C2FLTCON2bits __asm__ ("C2FLTCON2") __attribute__((section("sfrs"), address(0xBF8810E0)));
extern volatile uint32_t        C2FLTCON2CLR __attribute__((section("sfrs"),address(0xBF8810E4)));
extern volatile uint32_t        C2FLTCON2SET __attribute__((section("sfrs"),address(0xBF8810E8)));
extern volatile uint32_t        C2FLTCON2INV __attribute__((section("sfrs"),address(0xBF8810EC)));
#define C2FLTCON3 C2FLTCON3
extern volatile uint32_t   C2FLTCON3 __attribute__((section("sfrs"), address(0xBF8810F0)));
typedef union {
  struct {
    uint32_t FSEL12:5;
    uint32_t MSEL12:2;
    uint32_t FLTEN12:1;
    uint32_t FSEL13:5;
    uint32_t MSEL13:2;
    uint32_t FLTEN13:1;
    uint32_t FSEL14:5;
    uint32_t MSEL14:2;
    uint32_t FLTEN14:1;
    uint32_t FSEL15:5;
    uint32_t MSEL15:2;
    uint32_t FLTEN15:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FLTCON3bits_t;
extern volatile __C2FLTCON3bits_t C2FLTCON3bits __asm__ ("C2FLTCON3") __attribute__((section("sfrs"), address(0xBF8810F0)));
extern volatile uint32_t        C2FLTCON3CLR __attribute__((section("sfrs"),address(0xBF8810F4)));
extern volatile uint32_t        C2FLTCON3SET __attribute__((section("sfrs"),address(0xBF8810F8)));
extern volatile uint32_t        C2FLTCON3INV __attribute__((section("sfrs"),address(0xBF8810FC)));
#define C2FLTCON4 C2FLTCON4
extern volatile uint32_t   C2FLTCON4 __attribute__((section("sfrs"), address(0xBF881100)));
typedef union {
  struct {
    uint32_t FSEL16:5;
    uint32_t MSEL16:2;
    uint32_t FLTEN16:1;
    uint32_t FSEL17:5;
    uint32_t MSEL17:2;
    uint32_t FLTEN17:1;
    uint32_t FSEL18:5;
    uint32_t MSEL18:2;
    uint32_t FLTEN18:1;
    uint32_t FSEL19:5;
    uint32_t MSEL19:2;
    uint32_t FLTEN19:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FLTCON4bits_t;
extern volatile __C2FLTCON4bits_t C2FLTCON4bits __asm__ ("C2FLTCON4") __attribute__((section("sfrs"), address(0xBF881100)));
extern volatile uint32_t        C2FLTCON4CLR __attribute__((section("sfrs"),address(0xBF881104)));
extern volatile uint32_t        C2FLTCON4SET __attribute__((section("sfrs"),address(0xBF881108)));
extern volatile uint32_t        C2FLTCON4INV __attribute__((section("sfrs"),address(0xBF88110C)));
#define C2FLTCON5 C2FLTCON5
extern volatile uint32_t   C2FLTCON5 __attribute__((section("sfrs"), address(0xBF881110)));
typedef union {
  struct {
    uint32_t FSEL20:5;
    uint32_t MSEL20:2;
    uint32_t FLTEN20:1;
    uint32_t FSEL21:5;
    uint32_t MSEL21:2;
    uint32_t FLTEN21:1;
    uint32_t FSEL22:5;
    uint32_t MSEL22:2;
    uint32_t FLTEN22:1;
    uint32_t FSEL23:5;
    uint32_t MSEL23:2;
    uint32_t FLTEN23:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FLTCON5bits_t;
extern volatile __C2FLTCON5bits_t C2FLTCON5bits __asm__ ("C2FLTCON5") __attribute__((section("sfrs"), address(0xBF881110)));
extern volatile uint32_t        C2FLTCON5CLR __attribute__((section("sfrs"),address(0xBF881114)));
extern volatile uint32_t        C2FLTCON5SET __attribute__((section("sfrs"),address(0xBF881118)));
extern volatile uint32_t        C2FLTCON5INV __attribute__((section("sfrs"),address(0xBF88111C)));
#define C2FLTCON6 C2FLTCON6
extern volatile uint32_t   C2FLTCON6 __attribute__((section("sfrs"), address(0xBF881120)));
typedef union {
  struct {
    uint32_t FSEL24:5;
    uint32_t MSEL24:2;
    uint32_t FLTEN24:1;
    uint32_t FSEL25:5;
    uint32_t MSEL25:2;
    uint32_t FLTEN25:1;
    uint32_t FSEL26:5;
    uint32_t MSEL26:2;
    uint32_t FLTEN26:1;
    uint32_t FSEL27:5;
    uint32_t MSEL27:2;
    uint32_t FLTEN27:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FLTCON6bits_t;
extern volatile __C2FLTCON6bits_t C2FLTCON6bits __asm__ ("C2FLTCON6") __attribute__((section("sfrs"), address(0xBF881120)));
extern volatile uint32_t        C2FLTCON6CLR __attribute__((section("sfrs"),address(0xBF881124)));
extern volatile uint32_t        C2FLTCON6SET __attribute__((section("sfrs"),address(0xBF881128)));
extern volatile uint32_t        C2FLTCON6INV __attribute__((section("sfrs"),address(0xBF88112C)));
#define C2FLTCON7 C2FLTCON7
extern volatile uint32_t   C2FLTCON7 __attribute__((section("sfrs"), address(0xBF881130)));
typedef union {
  struct {
    uint32_t FSEL28:5;
    uint32_t MSEL28:2;
    uint32_t FLTEN28:1;
    uint32_t FSEL29:5;
    uint32_t MSEL29:2;
    uint32_t FLTEN29:1;
    uint32_t FSEL30:5;
    uint32_t MSEL30:2;
    uint32_t FLTEN30:1;
    uint32_t FSEL31:5;
    uint32_t MSEL31:2;
    uint32_t FLTEN31:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FLTCON7bits_t;
extern volatile __C2FLTCON7bits_t C2FLTCON7bits __asm__ ("C2FLTCON7") __attribute__((section("sfrs"), address(0xBF881130)));
extern volatile uint32_t        C2FLTCON7CLR __attribute__((section("sfrs"),address(0xBF881134)));
extern volatile uint32_t        C2FLTCON7SET __attribute__((section("sfrs"),address(0xBF881138)));
extern volatile uint32_t        C2FLTCON7INV __attribute__((section("sfrs"),address(0xBF88113C)));
#define C2RXF0 C2RXF0
extern volatile uint32_t   C2RXF0 __attribute__((section("sfrs"), address(0xBF881140)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF0bits_t;
